Spacedays/QVADRANS-SimpleFOC-Controller/variants/QVADRANS_V1/variant_QVADRANS_V1.h
/*
 *******************************************************************************
 * Copyright (c) 2019-2021, STMicroelectronics
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#pragma once

/*----------------------------------------------------------------------------
 *        STM32 pins number
 *----------------------------------------------------------------------------*/
// listing in chip order
// LEFT
#define PC13                    0   //
#define PC14                    1   //
#define PC15                    2   //
#define PF0                     3   // OSC_IN
#define PF1                     4   // OSC_OUT
#define PG10                    5   // NRST
#define PA0                     PIN_A0  // CURR_SENSE1_3V
#define PA1                     PIN_A1  // CURR_SENSE2_3V
#define PA2                     PIN_A2  // CURR_SENSE3_3V
#define PA3                     PIN_A3  // x
#define PA4                     PIN_A4  // SPI1_NSS, SPI3_NSS
// BOTTOM
#define PA5                     PIN_A5  // SPI1_SCK
#define PA6                     PIN_A6  // SPI1_MISO
#define PA7                     PIN_A7  // SPI1_MOSI
#define PC4                     PIN_A8  // x
#define PB0                     PIN_A9  // x
#define PB1                     PIN_A10 // x
#define PB2                     PIN_A11 // x
#define PB10                    18  // USART3_TX
#define PB11                    PIN_A12 // USART3_RX
// RIGHT
#define PB12                    PIN_A13 // USART3_CK
#define PB13                    21  // PWM_CH1N
#define PB14                    22  // PWM_CH2N
#define PB15                    23  // PWM_CH3N
#define PC6                     24  // x
#define PA8                     25  // PWM_CH1
#define PA9                     26  // PWM_CH2
#define PA10                    27  // PWM_CH3
#define PA11                    28  // FDCAN1_RX
#define PA12                    29  // FDCAN1_TX
#define PA13                    30  // SWDIO, I2C1_SCL (alt)
// TOP
#define PA14                    31  // SWCLK, I2C1_SDA (alt)
#define PA15                    32  // I2C1_SCL, SPI1_NSS, SPI3_NSS
#define PC10                    33  // UART4_TX
#define PC11                    34  // UART4_RX
#define PB3                     35  // USART2_TX, SPI3_SCK
#define PB4                     36  // USART2_RX, SPI3_MISO
#define PB5                     37  // USART2_CK, SPI3_MOSI
#define PB6                     38  // USART1_TX (ck used by pwm_ch1 - use as uart only)
#define PB7                     39  // USART1_RX (ck used by pwm_ch1 - use as uart only)
#define PB8                     40  // BOOT0
#define PB9                     41  // I2C1_SDA

// Alternate pins number
#define PA0_ALT1                (PA0  | ALT1)
#define PA1_ALT1                (PA1  | ALT1)
#define PA2_ALT1                (PA2  | ALT1)
#define PA3_ALT1                (PA3  | ALT1)
#define PA4_ALT1                (PA4  | ALT1)
#define PA6_ALT1                (PA6  | ALT1)
#define PA7_ALT1                (PA7  | ALT1)
#define PA7_ALT2                (PA7  | ALT2)
#define PA7_ALT3                (PA7  | ALT3)
#define PA9_ALT1                (PA9  | ALT1)
#define PA10_ALT1               (PA10 | ALT1)
#define PA11_ALT1               (PA11 | ALT1)
#define PA11_ALT2               (PA11 | ALT2)
#define PA12_ALT1               (PA12 | ALT1)
#define PA12_ALT2               (PA12 | ALT2)
#define PA13_ALT1               (PA13 | ALT1)
#define PA15_ALT1               (PA15 | ALT1)
#define PB0_ALT1                (PB0  | ALT1)
#define PB0_ALT2                (PB0  | ALT2)
#define PB1_ALT1                (PB1  | ALT1)
#define PB1_ALT2                (PB1  | ALT2)
#define PB3_ALT1                (PB3  | ALT1)
#define PB4_ALT1                (PB4  | ALT1)
#define PB4_ALT2                (PB4  | ALT2)
#define PB5_ALT1                (PB5  | ALT1)
#define PB5_ALT2                (PB5  | ALT2)
#define PB6_ALT1                (PB6  | ALT1)
#define PB6_ALT2                (PB6  | ALT2)
#define PB7_ALT1                (PB7  | ALT1)
#define PB7_ALT2                (PB7  | ALT2)
#define PB8_ALT1                (PB8  | ALT1)
#define PB8_ALT2                (PB8  | ALT2)
#define PB9_ALT1                (PB9  | ALT1)
#define PB9_ALT2                (PB9  | ALT2)
#define PB9_ALT3                (PB9  | ALT3)
#define PB11_ALT1               (PB11 | ALT1)
#define PB13_ALT1               (PB13 | ALT1)
#define PB14_ALT1               (PB14 | ALT1)
#define PB15_ALT1               (PB15 | ALT1)
#define PB15_ALT2               (PB15 | ALT2)
#define PC6_ALT1                (PC6  | ALT1)
#define PC13_ALT1               (PC13 | ALT1)

#define NUM_DIGITAL_PINS        42
#define NUM_ANALOG_INPUTS       14

/* Alias */
#define A_PWM_CH1               PA8
#define A_PWM_CH2               PA9
#define A_PWM_CH3               PA10
#define A_PWM_CH1N              PB13
#define A_PWM_CH2N              PB14
#define A_PWM_CH3N              PB15
#define A_CS1_3V                PA0
#define A_CS2_3V                PA1
#define A_CS3_3V                PA2
#define A_SPI1_SCK              PA5
#define A_SPI1_MISO             PA6
#define A_SPI1_MOSI             PA7
#define A_SPI1_NSS              PA4
#define A_UART1_TX              PB6
#define A_UART1_RX              PB7
#define A_USART2_TX             PB3
#define A_USART2_RX             PB4
#define A_USART2_CK             PB5
#define A_USART3_TX             PB10
#define A_USART3_RX             PB11
#define A_USART3_CK             PB12
#define A_I2C1_SCL              PA15
#define A_I2C1_SDA              PB9
#define A_CAN_RX                PA11
#define A_CAN_TX                PA12
#define A_SWDIO                 PA13
#define A_SWCLK                 PA14

// On-board LED pin number
#define LED_BLUE                PC11
#ifndef LED_BUILTIN
  #define LED_BUILTIN           LED_BLUE
#endif

// SPI definitions
#ifndef PIN_SPI_SS
  #define PIN_SPI_SS            A_SPI1_NSS
#endif
#ifndef PIN_SPI_SS1
  #define PIN_SPI_SS1           PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_SS2
  #define PIN_SPI_SS2           PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_SS3
  #define PIN_SPI_SS3           PNUM_NOT_DEFINED
#endif
#ifndef PIN_SPI_MOSI
  #define PIN_SPI_MOSI          A_SPI1_MOSI
#endif
#ifndef PIN_SPI_MISO
  #define PIN_SPI_MISO          A_SPI1_MISO
#endif
#ifndef PIN_SPI_SCK
  #define PIN_SPI_SCK           A_SPI1_SCK
#endif

// I2C definitions
#ifndef PIN_WIRE_SDA
  #define PIN_WIRE_SDA          PB7
#endif
#ifndef PIN_WIRE_SCL
  #define PIN_WIRE_SCL          PB8
#endif

// // Timer Definitions
// // Use TIM6/TIM7 when possible as servo and tone don't need GPIO output pin
// #ifndef TIMER_TONE
//   #define TIMER_TONE            TIM6
// #endif
// #ifndef TIMER_SERVO
//   #define TIMER_SERVO           TIM7
// #endif

// UART Definitions
#define SERIAL_UART_INSTANCE    2

// Default pin used for 'Serial' instance (ex: ST-Link)
// Mandatory for Firmata
#ifndef PIN_SERIAL_RX
  #define PIN_SERIAL_RX         PB11
#endif
#ifndef PIN_SERIAL_TX
  #define PIN_SERIAL_TX         PB10
#endif

/* HAL configuration */
#define HSE_VALUE               (24000000UL)

/* Extra HAL modules */
#if !defined(HAL_DAC_MODULE_DISABLED)
  #define HAL_DAC_MODULE_ENABLED
#endif
#if !defined(HAL_FDCAN_MODULE_DISABLED)
  #define HAL_FDCAN_MODULE_ENABLED
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus
  // These serial port names are intended to allow libraries and architecture-neutral
  // sketches to automatically default to the correct port name for a particular type
  // of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
  // the first hardware serial port whose RX/TX pins are not dedicated to another use.
  //
  // SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
  //
  // SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
  //
  // SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
  //
  // SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
  //
  // SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
  //                            pins are NOT connected to anything by default.
  #define SERIAL_PORT_MONITOR   Serial
  #define SERIAL_PORT_HARDWARE  SerialLP1
#endif
